Repository: LengTech11/notica
Catalog: lib/l10n/app_*.arb
Languages: km

# appTitle
source: Notica
km: ណូធីកា

source: New Reminder
km: ការរំលឹកថ្មី

source: Create Reminder
km: បង្កើតការរំលឹក

source: Edit Reminder
km: កែសម្រួលការរំលឹក

source: Delete Reminder
km: លុបការរំលឹក

source: Settings
km: ការកំណត់

source: About Notica
km: អំពីណូធីកា

source: Test Notification
km: សាកល្បងការជូនដំណឹង

source: Welcome to Notica!
km: សូមស្វាគមន៍មកកាន់ណូធីកា!

# createFirstReminder
source: Create your first reminder to get started
km: បង្កើតការរំលឹកដំបូងរបស់អ្នកដើម្បីចាប់ផ្តើម

# createFirstReminderButton
source: Create First Reminder
km: បង្កើតការរំលឹកដំបូង

# todayOverview
source: Today's Overview
km: ទិដ្ឋភាពទូទៅថ្ងៃនេះ

source: Progress
km: វឌ្ឍនភាព

source: Due Now
km: ដល់ពេលហើយ

source: Upcoming
km: ខាងមុខ

source: Today
km: ថ្ងៃនេះ

source: Tomorrow
km: ថ្ងៃស្អែក

source: Reminders Due Now
km: ការរំលឹកដល់ពេលហើយ

source: Snooze
km: ពន្យារពេល

source: Done
km: រួចរាល់

source: Snooze Reminder
km: ពន្យារពេលការរំលឹក

# minutes15
source: 15 minutes
km: ១៥ នាទី

# hour1
source: 1 hour
km: ១ ម៉ោង

source: Edit
km: កែសម្រួល

source: Delete
km: លុប

source: Cancel
km: បោះបង់

source: Retry
km: ព្យាយាមម្តងទៀត

source: OK
km: យល់ព្រម

# deleteReminderConfirm
source: Are you sure you want to delete "{title}"?
km: តើអ្នកប្រាកដជាចង់លុប "{title}" ទេ?

source: Reminder Title *
km: ចំណងជើងការរំលឹក *

# reminderTitleHint
source: e.g., Take medication, Call dentist, Meeting
km: ឧ. ញ៉ាំថ្នាំ, ទូរស័ព្ទទៅធ្មេញ, ប្រជុំ

# pleaseEnterTitle
source: Please enter a reminder title
km: សូមបញ្ចូលចំណងជើងការរំលឹក

# titleTooShort
source: Title must be at least 2 characters long
km: ចំណងជើងត្រូវតែមានយ៉ាងហោចណាស់ ២ តួអក្សរ

# description
source: Description (Optional)
km: ការពណ៌នា (ស្រេចចិត្ត)

# descriptionHint
source: Add details about this reminder...
km: បន្ថែមព័ត៌មានលម្អិតអំពីការរំលឹកនេះ...

# whenRemindYou
source: When should we remind you?
km: តើយើងគួររំលឹកអ្នកនៅពេលណា?

source: How often?
km: រៀងរាល់ប៉ុន្មាន?

source: Priority
km: អាទិភាព

# tags
source: Tags (Optional)
km: ស្លាក (ស្រេចចិត្ត)

# tagsHint
source: e.g., health, work, personal
km: ឧ. សុខភាព, ការងារ, ផ្ទាល់ខ្លួន

source: Save Reminder
km: រក្សាទុកការរំលឹក

# createReminderButton
source: Create Reminder
km: បង្កើតការរំលឹក

# reminderCreated
source: Reminder created successfully!
km: បង្កើតការរំលឹកបានជោគជ័យ!

# reminderUpdated
source: Reminder updated successfully!
km: ធ្វើបច្ចុប្បន្នភាពការរំលឹកបានជោគជ័យ!

source: Reminder deleted
km: លុបការរំលឹកហើយ

# reminderCompleted
source: "{title}" completed! 🎉
km: "{title}" បានបញ្ចប់! 🎉

# reminderUncompleted
source: "{title}" unmarked as completed
km: "{title}" បានដកការសម្គាល់ថាបានបញ្ចប់

# frequencyOnce
source: Once
km: ម្តងគត់

# frequencyDaily
source: Daily
km: ប្រចាំថ្ងៃ

# frequencyWeekly
source: Weekly
km: ប្រចាំសប្តាហ៍

# frequencyMonthly
source: Monthly
km: ប្រចាំខែ

# frequencyWeekdays
source: Weekdays
km: ថ្ងៃធ្វើការ

# frequencyWeekends
source: Weekends
km: ចុងសប្តាហ៍

# priorityLow
source: Low
km: ទាប

# priorityNormal
source: Normal
km: ធម្មតា

# priorityHigh
source: High
km: ខ្ពស់

# priorityUrgent
source: Urgent
km: បន្ទាន់

source: Notifications Disabled
km: ការជូនដំណឹងត្រូវបានបិទ

# settingsComingSoon
source: Settings will be available in future updates.
km: ការកំណត់នឹងមាននៅក្នុងការធ្វើបច្ចុប្បន្នភាពនាពេលអនាគត។

# aboutDescription
source: A modern reminder and notification app designed to help you stay organized and never miss important tasks.
km: កម្មវិធីរំលឹកនិងការជូនដំណឹងទំនើបដែលរចនាឡើងដើម្បីជួយអ្នកឱ្យរៀបចំនិងមិនខកខានភារកិច្ចសំខាន់ៗ។

# dayAgo
source: {count} day ago
km: {count} ថ្ងៃមុន

# daysAgo
source: {count} days ago
km: {count} ថ្ងៃមុន

# inDay
source: in {count} day
km: ក្នុងរយៈពេល {count} ថ្ងៃ

# inDays
source: in {count} days
km: ក្នុងរយៈពេល {count} ថ្ងៃ

source: at
km: នៅម៉ោង

source: Language
km: ភាសា

source: Change Language
km: ប្តូរភាសា
